app/controllers/gossips_controller.rb

    def show
        #puts "C" *50
        #puts params[:id]
        #puts "X" *50
        @gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def update
        @gossip = Gossip.find(params[:id])
        gossip_params = params.require(:gossip).permit(:title, :content)
        @gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "modifi"], ["content", "changeu"], ["updated_at", "2021-08-04 14:48:17.122844"], ["id", 3]]

    def create
        gossip_params = params.require(:gossip).permit(:title, :content, :user_id)
        gossip = Gossip.create(gossip_params)
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "dddd"], ["content", "vdvdv"], ["user_id", 2], ["created_at", "2021-08-04 15:19:22.922934"], ["updated_at", "2021-08-04 15:19:22.922934"]]